# FbxLightTotalLightLoss Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FbxLightTotalLightLoss Property
ParameterTypeId Class See Also
---
"Total Light Loss Factor"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FbxLightTotalLightLoss { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FbxLightTotalLightLoss As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FbxLightTotalLightLoss {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace